bagasbudhi/Porting_XST_X1-02_Cortex_M3/iot/boards.txt

#arduino_due_x_dbg.name=Arduino Due (Programming Port)
#arduino_due_x_dbg.vid.0=0x2341
#arduino_due_x_dbg.pid.0=0x003d
#arduino_due_x_dbg.vid.1=0x2A03
#arduino_due_x_dbg.pid.1=0x003d
#arduino_due_x_dbg.upload.tool=bossac
#arduino_due_x_dbg.upload.protocol=sam-ba
#arduino_due_x_dbg.upload.maximum_size=524288
#arduino_due_x_dbg.upload.use_1200bps_touch=true
#arduino_due_x_dbg.upload.wait_for_upload_port=false
#arduino_due_x_dbg.upload.native_usb=false
#arduino_due_x_dbg.build.mcu=cortex-m3
#arduino_due_x_dbg.build.f_cpu=84000000L
#arduino_due_x_dbg.build.usb_manufacturer="Arduino LLC"
#arduino_due_x_dbg.build.usb_product="Arduino Due"
#arduino_due_x_dbg.build.board=SAM_DUE
#arduino_due_x_dbg.build.core=arduino
#arduino_due_x_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
#arduino_due_x_dbg.build.ldscript=linker_scripts/gcc/flash.ld
#arduino_due_x_dbg.build.variant=arduino_due_x
#arduino_due_x_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
#arduino_due_x_dbg.build.vid=0x2341
#arduino_due_x_dbg.build.pid=0x003e

X1-01.name=Xirka X1-01
X1-01.upload.tool=pylinkDownloader
X1-01.upload.protocol=
X1-01.upload.maximum_size=65536
X1-01.build.mcu=cortex-m3
X1-01.build.f_cpu=20000000L
X1-01.build.board=X1_01
X1-01.build.core=xst
X1-01.build.extra_flags=-MMD -MP -c
X1-01.build.variant=X1-01

X1-02.name=Xirka X1-02
X1-02.upload.tool=pylinkDownloader
X1-02.upload.protocol=
X1-02.upload.maximum_size=1048576
X1-02.build.core=xst
X1-02.build.board=X1_02
X1-02.build.variant=X1-02
